tap "homebrew/services"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Command-line DNS Client for Humans
brew "doggo"
# GitHub command-line tool
brew "gh"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LLVM's OpenMP runtime library
brew "libomp"
# Postgres C API library
brew "libpq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Python version management
brew "pyenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Zsh productivity plugins
brew "zsh-autosuggestions"      # Fish-like autosuggestions for zsh
brew "zsh-syntax-highlighting"  # Syntax highlighting for zsh
brew "zoxide"                   # Smart directory jumper (modern z replacement)
# Modern CLI tools
brew "bat"          # Better cat with syntax highlighting
brew "eza"          # Better ls with colors and icons
brew "fd"           # Better find - fast and user-friendly
brew "ripgrep"      # Better grep - extremely fast search
brew "fzf"          # Fuzzy finder for files, history, commands
brew "tldr"         # Simplified man pages
brew "tree"         # Directory visualization
# Terminal-based AI coding assistant
cask "claude-code"
# Nerd Font with icons for terminal (required for eza icons)
cask "font-hack-nerd-font"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "docker.docker"
vscode "github.vscode-pull-request-github"
vscode "james-yu.latex-workshop"
vscode "karunamurti.haml"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "sarahridge.vscode-rails-syntax"
vscode "sianglim.slim"
